In [1]:
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load in 

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import accuracy_score

# Input data files are available in the "../input/" directory.
# For example, running this (by clicking run or pressing Shift+Enter) will list all files under the input directory

import os
for dirname, _, filenames in os.walk('/kaggle/input'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

# Any results you write to the current directory are saved as output.

/kaggle/input/titanic-solution-for-beginners-guide/test.csv
/kaggle/input/titanic-solution-for-beginners-guide/genderclassfare.csv
/kaggle/input/titanic-solution-for-beginners-guide/train.csv

In [2]:
df=pd.read_csv('../input/titanic-solution-for-beginners-guide/train.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
y=df.pop("Survived")

In [5]:
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
PassengerId    891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 76.7+ KB

In [7]:
numeric_variables=list(df.dtypes[df.dtypes!="object"].index)

In [8]:
df[numeric_variables].head()

   PassengerId  Pclass   Age  SibSp  Parch     Fare
0            1       3  22.0      1      0   7.2500
1            2       1  38.0      1      0  71.2833
2            3       3  26.0      0      0   7.9250
3            4       1  35.0      1      0  53.1000
4            5       3  35.0      0      0   8.0500

In [9]:
df["Age"].fillna(df.Age.mean(),inplace=True)

In [10]:
model= RandomForestClassifier(n_estimators=2500)
model.fit(df[numeric_variables],y)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
                       max_depth=None, max_features='auto', max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=2500,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [11]:
print("training accuracy:" , accuracy_score(y, model.predict(df[numeric_variables])))

training accuracy: 1.0

In [12]:
test=pd.read_csv("../input/titanic-solution-for-beginners-guide/test.csv")

In [13]:
test["Age"].fillna(df.Age.mean(),inplace=True)

In [14]:
test=test[numeric_variables].fillna(test.mean()).copy()

In [15]:
test

     PassengerId  Pclass        Age  SibSp  Parch      Fare
0            892       3  34.500000      0      0    7.8292
1            893       3  47.000000      1      0    7.0000
2            894       2  62.000000      0      0    9.6875
3            895       3  27.000000      0      0    8.6625
4            896       3  22.000000      1      1   12.2875
..           ...     ...        ...    ...    ...       ...
413         1305       3  29.699118      0      0    8.0500
414         1306       1  39.000000      0      0  108.9000
415         1307       3  38.500000      0      0    7.2500
416         1308       3  29.699118      0      0    8.0500
417         1309       3  29.699118      1      1   22.3583

[418 rows x 6 columns]

In [16]:
y_pred=model.predict(test[numeric_variables])

In [17]:
submission=pd.DataFrame({"PassengerId":test["PassengerId"],"Survived":y_pred})
submission.to_csv("titanic.csv",index=False)